# Task 2
# Вовочка, сидячи на уроці, писав поспіль однакові слова (слово може складатися з однієї літери). Коли Марія Іванівна забрала у нього зошит, там був один рядок тексту. Напишіть програму, яка визначить найкоротше слово з написаних Вовочкою. Наприклад:
# aaaaaaa - Вовочка писав слово - "a"
# ititititit - Вовочка писав слово - "it"
# catcatcatcat - Вовочка писав слово - "cat"

text = input("Впиши текст: ")

i = 1
first_char = text[0]
end = 0

while True:
    if text[i] == first_char:
        end = i
        break
    i += 1

print(text[:end])