# Task 5
# Попросіть користувача ввести свою вагу (в кілограмах) та зріст (в метрах).
#  Обчисліть і виведіть індекс маси тіла (BMI) за формулою: BMI = вага / (зріст^2). Далі виведіть відповідне повідомлення про стан ваги (наприклад, "Недостатньо ваги", "Нормальна вага", "Надлишкова вага", "Ожиріння").

mass = float(input("Введiть свою вагу (в кілограмах): "))
height = float(input("Введiть свiй зріст (в метрах): "))

bmi = mass / (height ** 2)

print(f"bmi: {bmi}.")
if bmi <= 18.5:
    print("Недостатньо ваги")
elif bmi <= 25:
    print("Нормальна вага")
elif bmi <= 30:
    print("Надлишкова вага")
else:
    print("Ожиріння")