# Task 1
# Написати скрипт, який запитує користувача, чи він володіє посвідченням водія (yes або no). Якщо користувач відповідає "yes", виведи повідомлення "Ви можете керувати автомобілем". Якщо користувач відповідає "no", виведи повідомлення "Ви не можете керувати автомобілем".

answer = str.lower( input("Чи ти володієш посвідченням водія? (yes/no)\n") )

if answer == "yes":
    print("Ви можете керувати автомобілем.")
elif answer == "no":
    print("Ви не можете керувати автомобілем.")
else:
    print("Не правильна вiдповiдь. Використовивай yes чи no.")
    #goto 4