# Task 2
# Написати скрипт, який запитує користувача про його вік і перевіряє, чи він відповідає критеріям для отримання прав на керування автомобілем. Критерії: користувач повинен бути старше 18 років.
# Якщо користувач задовольняє критерії, виведи повідомлення "Ви можете отримати посвідчення водія". Якщо користувач не задовольняє критерії, виведи повідомлення "Ви не відповідаєте критеріям для отримання посвідчення водія".

age = int( input("Введiть ваш вiк:\n") )

REQUIRE_AGE = 18

if age >= REQUIRE_AGE:
    print("Ви можете отримати посвідчення водія.")
else:
    print("Ви не відповідаєте критеріям для отримання посвідчення водія.")