# Task 3
# Написати скрипт, який перевіряє, чи введене число є додатнім і парним. Виведи повідомлення "Число є додатнім і парним", якщо число задовольняє обидва критерії. В іншому випадку, якщо число не є додатнім або не є парним, виведи повідомлення "Число не задовольняє критерії".
# Наприклад, якщо користувач вводить число 6, програма повинна вивести "Число є додатнім і парним". А якщо користувач вводить число -3, програма повинна вивести "Число не задовольняє критерії".

number = int( input("Введiть число:\n") )

if number % 2 == 0 and number >= 0:
    print("Число є додатнім і парним.")
else:
    print("Число не задовольняє критерії.")