# Task 1
# Дано число (чотиризначне). Перевірити, чи воно є «щасливим квитком».
# Примітка: щасливим квитком називається число, у якому, при парній кількості цифр, сума цифр його лівої половини дорівнює сумі цифр його правої половини.
# Наприклад, 1322 є щасливим квитком, тому що 1 + 3 = 2 + 2.

full_number = input("Введiть чотирьохзначне число: ")

numbers_unmap = list(full_number)
numbers = list(map(int, numbers_unmap))

if (numbers[0] == numbers[1] or numbers[-1] == numbers[-2]) and numbers[0] + numbers[1] == numbers[-1] + numbers[-2]:
    print("Щасливий квиток!")
else:
    print("Звичайний квиток.")