# 2. Дано два списки однакової довжини. Замінити кожен елемент першого списку на відповідний елемент другого списку.

list1 = [1, 2, 3, 4, 5]
list2 = ['a', 'b', 'c', 'd', 'e']

list1 = list2
print(list1)