# Task 3
# Напишіть функцію, яка приймає рядкові дані та виконує перевірку на їхню відповідність мейлу.
# Вимоги:
# -Цифри (0-9).
# -лише латинські літери у великому (A-Z) та малому (a-z) регістрах.
# -у тілі мейла допустимі лише символи "_" і "-". Але вони не можуть бути першим символом мейлу.
# -Символ "-" не може повторюватися.

import re

text = '999 azb AZB f*63# w9_-'
pattern = '([a-z]|[A-Z]|[0-9])(_*-{1})?' #???

result = re.findall(pattern, text)

for element in result:
    print(element)